export default {
    username: {
        reg: /^[a-zA-Z0-9_-]{4,16}$/g,
        msg: [
            '用户名必须是4到16位字符，包括字母、数字、下划线、减号',
        ]
    },
    pwd: {
        reg: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/g,
        msg: [
            '密码必须是最少6位字符，包括至少1个大写字母、1个小写字母、1个数字、1个特殊字符',
        ]
    },
    repeatpwd: {
        reg: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/g,
        msg: [
            '密码必须是最少6位字符，包括至少1个大写字母、1个小写字母、1个数字、1个特殊字符',
        ]
    },
    role: {
        reg: /^(BOSS|STAFF)$/g,
        msg: [
            '必填'
        ]
    }
}